<?php
/**
 * The template for displaying the footer
 *
 * Contains the closing of the #content div and all content after.
 *
 * @link https://developer.wordpress.org/themes/basics/template-files/#template-partials
 *
 * @package buffet-story
 */

?>
<div class="form container grid-12">
    <div class="form__inner">
        <div class="form__item__inner"></div>
        <div class="form__title">Рассчитайте кейтеринг или доставку еды на лучших условиях прямо сейчас</div>
        <?= do_shortcode('[contact-form-7 id="6c4e621" title="Форма для заявки"]'); ?>
    </div>
    <div class="form__map">
        <iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Af2bfef15ec3a87015cc6c9906ef24e97719121c4a599aaad4c2dc1ae7333ff46&amp;source=constructor" width="660" height="586" frameborder="0"></iframe>
    </div>
</div>
<footer class="footer container grid-12">
    <div class="footer__information">
        <a href="<?= home_url(); ?>" class="footer__information__logo">
            <img src="/wp-content/uploads/2025/09/logo_white.svg" alt="Логотип" loading="lazy">
        </a>
        <p class="footer__information__description"><?php the_field('footer_description', 10); ?></p>
        <a href="<?php get_field('footer_policy', 10) ?>" class="footer__information__policy" target="_blank">Политика конфиденциальности</a>
    </div>
    <div class="footer__navigation">
        <div class="footer__navigation__title">Навигация</div>
        <div class="footer__navigation__list">
            <?php
                $menu_items = wp_get_nav_menu_items(17);

                foreach ($menu_items as $menu_item) {
                    ?>
                        <a href="<?= $menu_item->url; ?>" class="footer__navigation__item"><?= $menu_item->title; ?></a>
                    <?php
                }
            ?>
        </div>
    </div>
    <div class="footer__contacts">
        <div class="footer__contacts__title">Контакты</div>
        <div class="footer__contacts__list">
            <div class="footer__contacts__item">
                <div class="footer__contacts__item__title">Часы работы</div>
                <p class="footer__contacts__item__description"><?php the_field('footer_work', 10); ?></p>
            </div>
            <div class="footer__contacts__item">
                <div class="footer__contacts__item__title">Адрес</div>
                <p class="footer__contacts__item__description"><?php the_field('footer_address', 10); ?></p>
            </div>
        </div>
    </div>
    <div class="footer__social">
        <div class="footer__social__icons">
            <?php if (get_field('footer_vk', 10)): ?>
            <a href="<?php the_field('footer_vk', 10); ?>" class="footer__social__icons__item">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="20" cy="20" r="20" fill="white"/>
                    <g clip-path="url(#clip0_404_10034)">
                        <path d="M19.9995 7.51953C13.1069 7.51953 7.51953 13.1069 7.51953 19.9995C7.51953 26.8921 13.1069 32.4795 19.9995 32.4795C26.8921 32.4795 32.4795 26.8921 32.4795 19.9995C32.4795 13.1069 26.8921 7.51953 19.9995 7.51953ZM24.7991 21.5998C24.7991 21.5998 25.9028 22.6892 26.1745 23.1949C26.1823 23.2062 26.1871 23.2149 26.1888 23.2209C26.2989 23.4055 26.3262 23.5516 26.2707 23.659C26.1797 23.8384 25.8677 23.9268 25.7611 23.9346H23.8111C23.6759 23.9346 23.3925 23.8995 23.0493 23.6629C22.7854 23.4783 22.5254 23.1754 22.2719 22.8803C21.8936 22.4409 21.566 22.0613 21.2358 22.0613C21.1939 22.0611 21.1522 22.0677 21.1123 22.0808C20.8627 22.1614 20.5429 22.5176 20.5429 23.4666C20.5429 23.763 20.3089 23.9333 20.1438 23.9333H19.2507C18.9465 23.9333 17.3618 23.8267 15.9578 22.346C14.2392 20.5325 12.6922 16.8951 12.6792 16.8613C12.5817 16.626 12.7832 16.4999 13.0029 16.4999H14.9724C15.235 16.4999 15.3208 16.6598 15.3806 16.8015C15.4508 16.9666 15.7082 17.6231 16.1307 18.3615C16.8158 19.5653 17.2357 20.0541 17.5724 20.0541C17.6356 20.0534 17.6976 20.0373 17.7531 20.0073C18.1925 19.7629 18.1106 18.1964 18.0911 17.8714C18.0911 17.8103 18.0898 17.1707 17.8649 16.8639C17.7037 16.6416 17.4294 16.5571 17.263 16.5259C17.3304 16.433 17.4191 16.3576 17.5217 16.3062C17.8233 16.1554 18.3667 16.1333 18.9062 16.1333H19.2065C19.7915 16.1411 19.9423 16.1788 20.1542 16.2321C20.5832 16.3348 20.5923 16.6117 20.5546 17.5594C20.5429 17.8285 20.5312 18.1327 20.5312 18.4915L20.5273 18.7411C20.5143 19.2234 20.4987 19.7707 20.8393 19.9956C20.8833 20.0246 20.9349 20.0396 20.9875 20.0385C21.1058 20.0385 21.462 20.0385 22.4266 18.3836C22.723 17.8504 22.9815 17.297 23.2001 16.7274C23.2196 16.6936 23.2768 16.5896 23.3444 16.5493C23.3948 16.5254 23.4498 16.5125 23.5056 16.5116H25.8209C26.0731 16.5116 26.246 16.5493 26.2785 16.6468C26.3357 16.8015 26.2681 17.2734 25.2112 18.7047L24.7393 19.3274C23.7812 20.5832 23.7812 20.6469 24.7991 21.5998Z" fill="#F07D2C"/>
                    </g>
                    <defs>
                        <clipPath id="clip0_404_10034">
                            <rect width="26" height="26" fill="white" transform="translate(7 7)"/>
                        </clipPath>
                    </defs>
                </svg>
            </a>
            <?php endif;
            if (get_field('footer_whatsapp', 10)): ?>
            <a href="<?php the_field('footer_whatsapp', 10); ?>" class="footer__social__icons__item">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="20" cy="20" r="20" fill="white"/>
                    <path d="M20.0013 9.16797C25.9846 9.16797 30.8347 14.0181 30.8347 20.0013C30.8347 25.9846 25.9846 30.8346 20.0013 30.8346C18.0868 30.8379 16.2059 30.3313 14.5522 29.3667L9.17232 30.8346L10.637 25.4526C9.67169 23.7983 9.16463 21.9167 9.16799 20.0013C9.16799 14.0181 14.0181 9.16797 20.0013 9.16797ZM16.3093 14.9096L16.0927 14.9183C15.9526 14.928 15.8157 14.9647 15.6897 15.0266C15.5722 15.0933 15.4649 15.1765 15.3712 15.2736C15.2412 15.3961 15.1675 15.5022 15.0884 15.6051C14.6877 16.1261 14.472 16.7657 14.4752 17.423C14.4774 17.9538 14.6161 18.4706 14.8327 18.9537C15.2758 19.9309 16.0049 20.9655 16.9669 21.9242C17.1987 22.155 17.4262 22.3868 17.6711 22.6024C18.8665 23.6547 20.2909 24.4137 21.8311 24.8189L22.4464 24.9131C22.6468 24.924 22.8472 24.9088 23.0487 24.8991C23.3642 24.8824 23.6722 24.797 23.9512 24.6488C24.0929 24.5755 24.2313 24.496 24.3661 24.4105C24.3661 24.4105 24.4119 24.3794 24.5015 24.313C24.6477 24.2046 24.7377 24.1277 24.859 24.001C24.95 23.9071 25.0258 23.798 25.0865 23.6738C25.171 23.4972 25.2555 23.1603 25.2902 22.8797C25.3162 22.6652 25.3086 22.5482 25.3053 22.4756C25.301 22.3597 25.2046 22.2395 25.0995 22.1886L24.469 21.9058C24.469 21.9058 23.5265 21.4952 22.9502 21.2331C22.8898 21.2068 22.8252 21.1917 22.7595 21.1886C22.6854 21.1809 22.6104 21.1892 22.5398 21.2129C22.4691 21.2366 22.4044 21.2753 22.35 21.3262C22.3446 21.3241 22.272 21.3858 21.4887 22.3348C21.4438 22.3952 21.3819 22.4409 21.3109 22.4659C21.2399 22.491 21.163 22.4944 21.0901 22.4756C21.0195 22.4568 20.9503 22.4329 20.8832 22.4041C20.7488 22.3478 20.7022 22.3261 20.6102 22.2871C19.9882 22.0162 19.4125 21.6496 18.9039 21.2006C18.7674 21.0814 18.6407 20.9514 18.5107 20.8257C18.0845 20.4175 17.713 19.9558 17.4057 19.4521L17.3417 19.3491C17.2965 19.2796 17.2594 19.2051 17.2312 19.1271C17.1901 18.9678 17.2973 18.84 17.2973 18.84C17.2973 18.84 17.5606 18.5518 17.683 18.3958C17.8022 18.2441 17.9029 18.0968 17.9679 17.9917C18.0957 17.7859 18.1358 17.5746 18.0687 17.4111C17.7653 16.6701 17.4519 15.933 17.1283 15.2C17.0644 15.0548 16.8748 14.9508 16.7026 14.9302C16.6441 14.923 16.5856 14.9172 16.5271 14.9129C16.3816 14.9045 16.2358 14.906 16.0905 14.9172L16.3093 14.9096Z" fill="#F07D2C"/>
                </svg>
            </a>
            <?php endif;
            if (get_field('footer_telegram', 10)): ?>
            <a href="<?php the_field('footer_telegram', 10); ?>" class="footer__social__icons__item">
                <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="20" cy="20" r="20" fill="white"/>
                    <path d="M20.0003 9.16797C14.0203 9.16797 9.16699 14.0213 9.16699 20.0013C9.16699 25.9813 14.0203 30.8346 20.0003 30.8346C25.9803 30.8346 30.8337 25.9813 30.8337 20.0013C30.8337 14.0213 25.9803 9.16797 20.0003 9.16797ZM25.027 16.5346C24.8645 18.2463 24.1603 22.4063 23.8028 24.3238C23.6512 25.1363 23.3478 25.4071 23.0662 25.4396C22.4378 25.4938 21.9612 25.028 21.3545 24.6271C20.4012 23.9988 19.8595 23.6088 18.9387 23.0021C17.8662 22.298 18.5595 21.908 19.177 21.2796C19.3395 21.1171 22.1128 18.593 22.167 18.3655C22.1745 18.331 22.1735 18.2952 22.1641 18.2613C22.1546 18.2273 22.137 18.1961 22.1128 18.1705C22.0478 18.1163 21.9612 18.138 21.8853 18.1488C21.7878 18.1705 20.2712 19.178 17.3137 21.1713C16.8803 21.4638 16.4903 21.6155 16.1437 21.6046C15.7537 21.5938 15.017 21.388 14.4645 21.2038C13.782 20.9871 13.2512 20.868 13.2945 20.4888C13.3162 20.2938 13.587 20.0988 14.0962 19.893C17.2595 18.5171 19.3612 17.6071 20.412 17.1738C23.4237 15.9171 24.0412 15.7005 24.4528 15.7005C24.5395 15.7005 24.7453 15.7221 24.8753 15.8305C24.9837 15.9171 25.0162 16.0363 25.027 16.123C25.0162 16.188 25.0378 16.383 25.027 16.5346Z" fill="#F07D2C"/>
                </svg>
            </a>
            <?php endif; ?>
        </div>
        <div class="footer__social__links">
            <div class="footer__social__links__item">
                <div class="footer__social__links__item__title">Контактный телефон</div>
                <a href="<?php the_field('footer_phone', 10); ?>" class="footer__social__links__item__description"><?php the_field('footer_phone', 10); ?></a>
            </div>
            <div class="footer__social__links__item">
                <div class="footer__social__links__item__title">Электронная почта</div>
                <a href="<?php the_field('footer_mail', 10); ?>" class="footer__social__links__item__description"><?php the_field('footer_mail', 10); ?></a>
            </div>
        </div>
    </div>
</footer>
<?php wp_footer(); ?>

</body>
</html>
